/********************************************************************************************************
 * @file    pke.h
 *
 * @brief   This is the header file for tl323x
 *
 * @author  Driver Group
 * @date    2025
 *
 * @par     Copyright (c) 2025, Telink Semiconductor (Shanghai) Co., Ltd. ("TELINK")
 *
 *          Licensed under the Apache License, Version 2.0 (the "License");
 *          you may not use this file except in compliance with the License.
 *          You may obtain a copy of the License at
 *
 *              http://www.apache.org/licenses/LICENSE-2.0
 *
 *          Unless required by applicable law or agreed to in writing, software
 *          distributed under the License is distributed on an "AS IS" BASIS,
 *          WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *          See the License for the specific language governing permissions and
 *          limitations under the License.
 *
 *******************************************************************************************************/
#ifndef PKE_H
#define PKE_H

#ifdef __cplusplus
extern "C"
{
#endif


#include "pke_common.h"
#include "lib/include/crypto_common/eccp_curve.h"


/***************** PKE register *******************/
#ifndef SUPPORT_STATIC_ANALYSIS
#define rPKE_CTRL     (*((volatile unsigned int *)(PKE_BASE_ADDR)))
#define rPKE_CFG      (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x04U)))
#define rPKE_MC_PTR   (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x08U)))
#define rPKE_RISR     (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x0CU)))
#define rPKE_IMCR     (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x10U)))
#define rPKE_MISR     (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x14U)))
#define rPKE_RT_CODE  (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x24U)))
#define rPKE_EXE_CONF (*((volatile unsigned int *)(PKE_BASE_ADDR + 0x50U)))
#define rPKE_VERSION  (*((volatile unsigned int *)(PKE_BASE_ADDR + 0xFCU)))
#else

/**
 * @brief           Structure representing the PKE registers.
 */
typedef struct
{
    unsigned int PKE_CTRL[1];   // 0x00
    unsigned int PKE_CFG[1];    // 0x04
    unsigned int PKE_MC_PTR[1]; // 0x08
    unsigned int PKE_RISR[1];   // 0x0C
    unsigned int PKE_IMCR[1];   // 0x10
    unsigned int PKE_MISR[1];   // 0x14
    unsigned int REV_1[3];
    unsigned int PKE_RT_CODE[1]; // 0x24
    unsigned int REV_2[10];
    unsigned int PKE_EXE_CONF[1]; // 0x50
    unsigned int REV_3[42];
    unsigned int PKE_VERSION[1]; // 0xFC
} pke_reg_t;

#ifdef CONFIG_UNIT_TEST
extern volatile pke_reg_t *g_pke_reg;
#else
extern volatile pke_reg_t *const g_pke_reg;
#endif

#define rPKE_CTRL     (*((volatile unsigned int *)(g_pke_reg->PKE_CTRL)))
#define rPKE_CFG      (*((volatile unsigned int *)(g_pke_reg->PKE_CFG)))
#define rPKE_MC_PTR   (*((volatile unsigned int *)(g_pke_reg->PKE_MC_PTR)))
#define rPKE_RISR     (*((volatile unsigned int *)(g_pke_reg->PKE_RISR)))
#define rPKE_IMCR     (*((volatile unsigned int *)(g_pke_reg->PKE_IMCR)))
#define rPKE_MISR     (*((volatile unsigned int *)(g_pke_reg->PKE_MISR)))
#define rPKE_RT_CODE  (*((volatile unsigned int *)(g_pke_reg->PKE_RT_CODE)))
#define rPKE_EXE_CONF (*((volatile unsigned int *)(g_pke_reg->PKE_EXE_CONF)))
#define rPKE_VERSION  (*((volatile unsigned int *)(g_pke_reg->PKE_VERSION)))

#endif

/*********** PKE register action offset ************/
#define PKE_START_CALC              (1U)

